Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/pps.h
#define PPS_CCLIN4R_CCLIN4_Pos                _UINT32_(0)                                          /* (PPS_CCLIN4R) CCL/IN4 Position */
#define PPS_CCLIN4R_CCLIN4_Msk                (_UINT32_(0xF) << PPS_CCLIN4R_CCLIN4_Pos)            /* (PPS_CCLIN4R) CCL/IN4 Mask */
#define PPS_CCLIN4R_CCLIN4(value)             (PPS_CCLIN4R_CCLIN4_Msk & (_UINT32_(value) << PPS_CCLIN4R_CCLIN4_Pos)) /* Assigment of value for CCLIN4 in the PPS_CCLIN4R register */
#define   PPS_CCLIN4R_CCLIN4_RPA0_Val         _UINT32_(0xF)                                        /* (PPS_CCLIN4R) RPA0  */
#define   PPS_CCLIN4R_CCLIN4_RPA4_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN4R) RPA4  */
#define   PPS_CCLIN4R_CCLIN4_RPA8_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN4R) RPA8  */
#define   PPS_CCLIN4R_CCLIN4_RPA12_Val        _UINT32_(0x3)                                        /* (PPS_CCLIN4R) RPA12  */
#define   PPS_CCLIN4R_CCLIN4_RPB1_Val         _UINT32_(0x4)                                        /* (PPS_CCLIN4R) RPB1  */
#define   PPS_CCLIN4R_CCLIN4_RPB5_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN4R) RPB5  */
#define   PPS_CCLIN4R_CCLIN4_RPB9_Val         _UINT32_(0x6)                                        /* (PPS_CCLIN4R) RPB9  */
#define   PPS_CCLIN4R_CCLIN4_RPB13_Val        _UINT32_(0x7)                                        /* (PPS_CCLIN4R) RPB13  */
#define   PPS_CCLIN4R_CCLIN4_RPA3_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN4R) RPA3  */
#define   PPS_CCLIN4R_CCLIN4_RPA7_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN4R) RPA7  */
#define   PPS_CCLIN4R_CCLIN4_RPA11_Val        _UINT32_(0xA)                                        /* (PPS_CCLIN4R) RPA11  */
#define   PPS_CCLIN4R_CCLIN4_RPB0_Val         _UINT32_(0xB)                                        /* (PPS_CCLIN4R) RPB0  */
#define   PPS_CCLIN4R_CCLIN4_RPB4_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN4R) RPB4  */
#define   PPS_CCLIN4R_CCLIN4_RPB8_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN4R) RPB8  */
#define   PPS_CCLIN4R_CCLIN4_RPB12_Val        _UINT32_(0xE)                                        /* (PPS_CCLIN4R) RPB12  */
#define   PPS_CCLIN4R_CCLIN4_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN4R) OFF  */
#define PPS_CCLIN4R_CCLIN4_RPA0               (PPS_CCLIN4R_CCLIN4_RPA0_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA0 Position  */
#define PPS_CCLIN4R_CCLIN4_RPA4               (PPS_CCLIN4R_CCLIN4_RPA4_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA4 Position  */
#define PPS_CCLIN4R_CCLIN4_RPA8               (PPS_CCLIN4R_CCLIN4_RPA8_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA8 Position  */
#define PPS_CCLIN4R_CCLIN4_RPA12              (PPS_CCLIN4R_CCLIN4_RPA12_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA12 Position  */
#define PPS_CCLIN4R_CCLIN4_RPB1               (PPS_CCLIN4R_CCLIN4_RPB1_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB1 Position  */
#define PPS_CCLIN4R_CCLIN4_RPB5               (PPS_CCLIN4R_CCLIN4_RPB5_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB5 Position  */
#define PPS_CCLIN4R_CCLIN4_RPB9               (PPS_CCLIN4R_CCLIN4_RPB9_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB9 Position  */
#define PPS_CCLIN4R_CCLIN4_RPB13              (PPS_CCLIN4R_CCLIN4_RPB13_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB13 Position  */
#define PPS_CCLIN4R_CCLIN4_RPA3               (PPS_CCLIN4R_CCLIN4_RPA3_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA3 Position  */
#define PPS_CCLIN4R_CCLIN4_RPA7               (PPS_CCLIN4R_CCLIN4_RPA7_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA7 Position  */
#define PPS_CCLIN4R_CCLIN4_RPA11              (PPS_CCLIN4R_CCLIN4_RPA11_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA11 Position  */
#define PPS_CCLIN4R_CCLIN4_RPB0               (PPS_CCLIN4R_CCLIN4_RPB0_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB0 Position  */
#define PPS_CCLIN4R_CCLIN4_RPB4               (PPS_CCLIN4R_CCLIN4_RPB4_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB4 Position  */
#define PPS_CCLIN4R_CCLIN4_RPB8               (PPS_CCLIN4R_CCLIN4_RPB8_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB8 Position  */
#define PPS_CCLIN4R_CCLIN4_RPB12              (PPS_CCLIN4R_CCLIN4_RPB12_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB12 Position  */
#define PPS_CCLIN4R_CCLIN4_OFF                (PPS_CCLIN4R_CCLIN4_OFF_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) OFF Position  */
#define PPS_CCLIN4R_Msk                       _UINT32_(0x0000000F)                                 /* (PPS_CCLIN4R) Register Mask  */


/* -------- PPS_CCLIN5R : (PPS Offset: 0xAC) (R/W 32)  -------- */
#define PPS_CCLIN5R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_CCLIN5R)   Reset Value */

#define PPS_CCLIN5R_CCLIN5_Pos                _UINT32_(0)                                          /* (PPS_CCLIN5R) CCL/IN5 Position */
#define PPS_CCLIN5R_CCLIN5_Msk                (_UINT32_(0xF) << PPS_CCLIN5R_CCLIN5_Pos)            /* (PPS_CCLIN5R) CCL/IN5 Mask */
#define PPS_CCLIN5R_CCLIN5(value)             (PPS_CCLIN5R_CCLIN5_Msk & (_UINT32_(value) << PPS_CCLIN5R_CCLIN5_Pos)) /* Assigment of value for CCLIN5 in the PPS_CCLIN5R register */
#define   PPS_CCLIN5R_CCLIN5_RPA1_Val         _UINT32_(0xF)                                        /* (PPS_CCLIN5R) RPA1  */
#define   PPS_CCLIN5R_CCLIN5_RPA5_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN5R) RPA5  */
#define   PPS_CCLIN5R_CCLIN5_RPA9_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN5R) RPA9  */
#define   PPS_CCLIN5R_CCLIN5_RPA13_Val        _UINT32_(0x3)                                        /* (PPS_CCLIN5R) RPA13  */
#define   PPS_CCLIN5R_CCLIN5_RPB2_Val         _UINT32_(0x4)                                        /* (PPS_CCLIN5R) RPB2  */
#define   PPS_CCLIN5R_CCLIN5_RPB6_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN5R) RPB6  */
#define   PPS_CCLIN5R_CCLIN5_RPB10_Val        _UINT32_(0x6)                                        /* (PPS_CCLIN5R) RPB10  */
#define   PPS_CCLIN5R_CCLIN5_RPA0_Val         _UINT32_(0x7)                                        /* (PPS_CCLIN5R) RPA0  */
#define   PPS_CCLIN5R_CCLIN5_RPA4_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN5R) RPA4  */
#define   PPS_CCLIN5R_CCLIN5_RPA8_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN5R) RPA8  */
#define   PPS_CCLIN5R_CCLIN5_RPA12_Val        _UINT32_(0xA)                                        /* (PPS_CCLIN5R) RPA12  */
#define   PPS_CCLIN5R_CCLIN5_RPB1_Val         _UINT32_(0xB)                                        /* (PPS_CCLIN5R) RPB1  */
#define   PPS_CCLIN5R_CCLIN5_RPB5_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN5R) RPB5  */
#define   PPS_CCLIN5R_CCLIN5_RPB9_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN5R) RPB9  */
#define   PPS_CCLIN5R_CCLIN5_RPB13_Val        _UINT32_(0xE)                                        /* (PPS_CCLIN5R) RPB13  */
#define   PPS_CCLIN5R_CCLIN5_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN5R) OFF  */
#define PPS_CCLIN5R_CCLIN5_RPA1               (PPS_CCLIN5R_CCLIN5_RPA1_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA1 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA5               (PPS_CCLIN5R_CCLIN5_RPA5_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA5 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA9               (PPS_CCLIN5R_CCLIN5_RPA9_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA9 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA13              (PPS_CCLIN5R_CCLIN5_RPA13_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA13 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB2               (PPS_CCLIN5R_CCLIN5_RPB2_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB2 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB6               (PPS_CCLIN5R_CCLIN5_RPB6_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB6 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB10              (PPS_CCLIN5R_CCLIN5_RPB10_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB10 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA0               (PPS_CCLIN5R_CCLIN5_RPA0_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA0 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA4               (PPS_CCLIN5R_CCLIN5_RPA4_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA4 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA8               (PPS_CCLIN5R_CCLIN5_RPA8_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA8 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA12              (PPS_CCLIN5R_CCLIN5_RPA12_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA12 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB1               (PPS_CCLIN5R_CCLIN5_RPB1_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB1 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB5               (PPS_CCLIN5R_CCLIN5_RPB5_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB5 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB9               (PPS_CCLIN5R_CCLIN5_RPB9_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB9 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB13              (PPS_CCLIN5R_CCLIN5_RPB13_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB13 Position  */
#define PPS_CCLIN5R_CCLIN5_OFF                (PPS_CCLIN5R_CCLIN5_OFF_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) OFF Position  */
#define PPS_CCLIN5R_Msk                       _UINT32_(0x0000000F)                                 /* (PPS_CCLIN5R) Register Mask  */


