Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/pps.h
#define PPS_TC3WO1G4R_TC3WO1_Pos              _UINT32_(0)                                          /* (PPS_TC3WO1G4R) TC3/WO1G4 Position */
#define PPS_TC3WO1G4R_TC3WO1_Msk              (_UINT32_(0xF) << PPS_TC3WO1G4R_TC3WO1_Pos)          /* (PPS_TC3WO1G4R) TC3/WO1G4 Mask */
#define PPS_TC3WO1G4R_TC3WO1(value)           (PPS_TC3WO1G4R_TC3WO1_Msk & (_UINT32_(value) << PPS_TC3WO1G4R_TC3WO1_Pos)) /* Assigment of value for TC3WO1 in the PPS_TC3WO1G4R register */
#define   PPS_TC3WO1G4R_TC3WO1_RPA2_Val       _UINT32_(0xF)                                        /* (PPS_TC3WO1G4R) RPA2  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA6_Val       _UINT32_(0x1)                                        /* (PPS_TC3WO1G4R) RPA6  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA10_Val      _UINT32_(0x2)                                        /* (PPS_TC3WO1G4R) RPA10  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA14_Val      _UINT32_(0x3)                                        /* (PPS_TC3WO1G4R) RPA14  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB3_Val       _UINT32_(0x4)                                        /* (PPS_TC3WO1G4R) RPB3  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_TC3WO1G4R) RPB7  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB11_Val      _UINT32_(0x6)                                        /* (PPS_TC3WO1G4R) RPB11  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA1_Val       _UINT32_(0x7)                                        /* (PPS_TC3WO1G4R) RPA1  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA5_Val       _UINT32_(0x8)                                        /* (PPS_TC3WO1G4R) RPA5  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA9_Val       _UINT32_(0x9)                                        /* (PPS_TC3WO1G4R) RPA9  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA13_Val      _UINT32_(0xA)                                        /* (PPS_TC3WO1G4R) RPA13  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB2_Val       _UINT32_(0xB)                                        /* (PPS_TC3WO1G4R) RPB2  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB6_Val       _UINT32_(0xC)                                        /* (PPS_TC3WO1G4R) RPB6  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB10_Val      _UINT32_(0xD)                                        /* (PPS_TC3WO1G4R) RPB10  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA8_Val       _UINT32_(0xE)                                        /* (PPS_TC3WO1G4R) RPA8  */
#define   PPS_TC3WO1G4R_TC3WO1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC3WO1G4R) OFF  */
#define PPS_TC3WO1G4R_TC3WO1_RPA2             (PPS_TC3WO1G4R_TC3WO1_RPA2_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA2 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA6             (PPS_TC3WO1G4R_TC3WO1_RPA6_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA6 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA10            (PPS_TC3WO1G4R_TC3WO1_RPA10_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA10 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA14            (PPS_TC3WO1G4R_TC3WO1_RPA14_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA14 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB3             (PPS_TC3WO1G4R_TC3WO1_RPB3_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB3 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB7             (PPS_TC3WO1G4R_TC3WO1_RPB7_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB7 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB11            (PPS_TC3WO1G4R_TC3WO1_RPB11_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB11 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA1             (PPS_TC3WO1G4R_TC3WO1_RPA1_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA1 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA5             (PPS_TC3WO1G4R_TC3WO1_RPA5_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA5 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA9             (PPS_TC3WO1G4R_TC3WO1_RPA9_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA9 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA13            (PPS_TC3WO1G4R_TC3WO1_RPA13_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA13 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB2             (PPS_TC3WO1G4R_TC3WO1_RPB2_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB2 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB6             (PPS_TC3WO1G4R_TC3WO1_RPB6_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB6 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB10            (PPS_TC3WO1G4R_TC3WO1_RPB10_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB10 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA8             (PPS_TC3WO1G4R_TC3WO1_RPA8_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA8 Position  */
#define PPS_TC3WO1G4R_TC3WO1_OFF              (PPS_TC3WO1G4R_TC3WO1_OFF_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) OFF Position  */
#define PPS_TC3WO1G4R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC3WO1G4R) Register Mask  */


/* -------- PPS_TC4WO0G1R : (PPS Offset: 0xE8) (R/W 32)  -------- */
#define PPS_TC4WO0G1R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC4WO0G1R)   Reset Value */

#define PPS_TC4WO0G1R_TC4WO0_Pos              _UINT32_(0)                                          /* (PPS_TC4WO0G1R) TC4/WO0G1 Position */
#define PPS_TC4WO0G1R_TC4WO0_Msk              (_UINT32_(0xF) << PPS_TC4WO0G1R_TC4WO0_Pos)          /* (PPS_TC4WO0G1R) TC4/WO0G1 Mask */
#define PPS_TC4WO0G1R_TC4WO0(value)           (PPS_TC4WO0G1R_TC4WO0_Msk & (_UINT32_(value) << PPS_TC4WO0G1R_TC4WO0_Pos)) /* Assigment of value for TC4WO0 in the PPS_TC4WO0G1R register */
#define   PPS_TC4WO0G1R_TC4WO0_RPA9_Val       _UINT32_(0xF)                                        /* (PPS_TC4WO0G1R) RPA9  */
#define   PPS_TC4WO0G1R_TC4WO0_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_TC4WO0G1R) RPA3  */
#define   PPS_TC4WO0G1R_TC4WO0_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_TC4WO0G1R) RPA7  */
#define   PPS_TC4WO0G1R_TC4WO0_RPA11_Val      _UINT32_(0x3)                                        /* (PPS_TC4WO0G1R) RPA11  */
#define   PPS_TC4WO0G1R_TC4WO0_RPB0_Val       _UINT32_(0x4)                                        /* (PPS_TC4WO0G1R) RPB0  */
#define   PPS_TC4WO0G1R_TC4WO0_RPB4_Val       _UINT32_(0x5)                                        /* (PPS_TC4WO0G1R) RPB4  */
#define   PPS_TC4WO0G1R_TC4WO0_RPB8_Val       _UINT32_(0x6)                                        /* (PPS_TC4WO0G1R) RPB8  */
#define   PPS_TC4WO0G1R_TC4WO0_RPB12_Val      _UINT32_(0x7)                                        /* (PPS_TC4WO0G1R) RPB12  */
#define   PPS_TC4WO0G1R_TC4WO0_RPA2_Val       _UINT32_(0x8)                                        /* (PPS_TC4WO0G1R) RPA2  */
#define   PPS_TC4WO0G1R_TC4WO0_RPA6_Val       _UINT32_(0x9)                                        /* (PPS_TC4WO0G1R) RPA6  */
#define   PPS_TC4WO0G1R_TC4WO0_RPA10_Val      _UINT32_(0xA)                                        /* (PPS_TC4WO0G1R) RPA10  */
#define   PPS_TC4WO0G1R_TC4WO0_RPA14_Val      _UINT32_(0xB)                                        /* (PPS_TC4WO0G1R) RPA14  */
#define   PPS_TC4WO0G1R_TC4WO0_RPB3_Val       _UINT32_(0xC)                                        /* (PPS_TC4WO0G1R) RPB3  */
#define   PPS_TC4WO0G1R_TC4WO0_RPB7_Val       _UINT32_(0xD)                                        /* (PPS_TC4WO0G1R) RPB7  */
#define   PPS_TC4WO0G1R_TC4WO0_RPB11_Val      _UINT32_(0xE)                                        /* (PPS_TC4WO0G1R) RPB11  */
#define   PPS_TC4WO0G1R_TC4WO0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC4WO0G1R) OFF  */
#define PPS_TC4WO0G1R_TC4WO0_RPA9             (PPS_TC4WO0G1R_TC4WO0_RPA9_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPA9 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPA3             (PPS_TC4WO0G1R_TC4WO0_RPA3_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPA3 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPA7             (PPS_TC4WO0G1R_TC4WO0_RPA7_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPA7 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPA11            (PPS_TC4WO0G1R_TC4WO0_RPA11_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPA11 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPB0             (PPS_TC4WO0G1R_TC4WO0_RPB0_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPB0 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPB4             (PPS_TC4WO0G1R_TC4WO0_RPB4_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPB4 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPB8             (PPS_TC4WO0G1R_TC4WO0_RPB8_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPB8 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPB12            (PPS_TC4WO0G1R_TC4WO0_RPB12_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPB12 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPA2             (PPS_TC4WO0G1R_TC4WO0_RPA2_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPA2 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPA6             (PPS_TC4WO0G1R_TC4WO0_RPA6_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPA6 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPA10            (PPS_TC4WO0G1R_TC4WO0_RPA10_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPA10 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPA14            (PPS_TC4WO0G1R_TC4WO0_RPA14_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPA14 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPB3             (PPS_TC4WO0G1R_TC4WO0_RPB3_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPB3 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPB7             (PPS_TC4WO0G1R_TC4WO0_RPB7_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPB7 Position  */
#define PPS_TC4WO0G1R_TC4WO0_RPB11            (PPS_TC4WO0G1R_TC4WO0_RPB11_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) RPB11 Position  */
#define PPS_TC4WO0G1R_TC4WO0_OFF              (PPS_TC4WO0G1R_TC4WO0_OFF_Val << PPS_TC4WO0G1R_TC4WO0_Pos) /* (PPS_TC4WO0G1R) OFF Position  */
#define PPS_TC4WO0G1R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC4WO0G1R) Register Mask  */


