Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/pps.h
/* -------- PPS_TC7WO1G2R : (PPS Offset: 0x120) (R/W 32)  -------- */
#define PPS_TC7WO1G2R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC7WO1G2R)   Reset Value */

#define PPS_TC7WO1G2R_TC7WO1_Pos              _UINT32_(0)                                          /* (PPS_TC7WO1G2R) TC7/WO1G2 Position */
#define PPS_TC7WO1G2R_TC7WO1_Msk              (_UINT32_(0xF) << PPS_TC7WO1G2R_TC7WO1_Pos)          /* (PPS_TC7WO1G2R) TC7/WO1G2 Mask */
#define PPS_TC7WO1G2R_TC7WO1(value)           (PPS_TC7WO1G2R_TC7WO1_Msk & (_UINT32_(value) << PPS_TC7WO1G2R_TC7WO1_Pos)) /* Assigment of value for TC7WO1 in the PPS_TC7WO1G2R register */
#define   PPS_TC7WO1G2R_TC7WO1_RPA0_Val       _UINT32_(0xF)                                        /* (PPS_TC7WO1G2R) RPA0  */
#define   PPS_TC7WO1G2R_TC7WO1_RPA4_Val       _UINT32_(0x1)                                        /* (PPS_TC7WO1G2R) RPA4  */
#define   PPS_TC7WO1G2R_TC7WO1_RPA8_Val       _UINT32_(0x2)                                        /* (PPS_TC7WO1G2R) RPA8  */
#define   PPS_TC7WO1G2R_TC7WO1_RPA12_Val      _UINT32_(0x3)                                        /* (PPS_TC7WO1G2R) RPA12  */
#define   PPS_TC7WO1G2R_TC7WO1_RPB1_Val       _UINT32_(0x4)                                        /* (PPS_TC7WO1G2R) RPB1  */
#define   PPS_TC7WO1G2R_TC7WO1_RPB5_Val       _UINT32_(0x5)                                        /* (PPS_TC7WO1G2R) RPB5  */
#define   PPS_TC7WO1G2R_TC7WO1_RPB9_Val       _UINT32_(0x6)                                        /* (PPS_TC7WO1G2R) RPB9  */
#define   PPS_TC7WO1G2R_TC7WO1_RPB13_Val      _UINT32_(0x7)                                        /* (PPS_TC7WO1G2R) RPB13  */
#define   PPS_TC7WO1G2R_TC7WO1_RPA3_Val       _UINT32_(0x8)                                        /* (PPS_TC7WO1G2R) RPA3  */
#define   PPS_TC7WO1G2R_TC7WO1_RPA7_Val       _UINT32_(0x9)                                        /* (PPS_TC7WO1G2R) RPA7  */
#define   PPS_TC7WO1G2R_TC7WO1_RPA11_Val      _UINT32_(0xA)                                        /* (PPS_TC7WO1G2R) RPA11  */
#define   PPS_TC7WO1G2R_TC7WO1_RPB0_Val       _UINT32_(0xB)                                        /* (PPS_TC7WO1G2R) RPB0  */
#define   PPS_TC7WO1G2R_TC7WO1_RPB4_Val       _UINT32_(0xC)                                        /* (PPS_TC7WO1G2R) RPB4  */
#define   PPS_TC7WO1G2R_TC7WO1_RPB8_Val       _UINT32_(0xD)                                        /* (PPS_TC7WO1G2R) RPB8  */
#define   PPS_TC7WO1G2R_TC7WO1_RPB12_Val      _UINT32_(0xE)                                        /* (PPS_TC7WO1G2R) RPB12  */
#define   PPS_TC7WO1G2R_TC7WO1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC7WO1G2R) OFF  */
#define PPS_TC7WO1G2R_TC7WO1_RPA0             (PPS_TC7WO1G2R_TC7WO1_RPA0_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPA0 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPA4             (PPS_TC7WO1G2R_TC7WO1_RPA4_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPA4 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPA8             (PPS_TC7WO1G2R_TC7WO1_RPA8_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPA8 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPA12            (PPS_TC7WO1G2R_TC7WO1_RPA12_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPA12 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPB1             (PPS_TC7WO1G2R_TC7WO1_RPB1_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPB1 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPB5             (PPS_TC7WO1G2R_TC7WO1_RPB5_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPB5 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPB9             (PPS_TC7WO1G2R_TC7WO1_RPB9_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPB9 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPB13            (PPS_TC7WO1G2R_TC7WO1_RPB13_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPB13 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPA3             (PPS_TC7WO1G2R_TC7WO1_RPA3_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPA3 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPA7             (PPS_TC7WO1G2R_TC7WO1_RPA7_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPA7 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPA11            (PPS_TC7WO1G2R_TC7WO1_RPA11_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPA11 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPB0             (PPS_TC7WO1G2R_TC7WO1_RPB0_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPB0 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPB4             (PPS_TC7WO1G2R_TC7WO1_RPB4_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPB4 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPB8             (PPS_TC7WO1G2R_TC7WO1_RPB8_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPB8 Position  */
#define PPS_TC7WO1G2R_TC7WO1_RPB12            (PPS_TC7WO1G2R_TC7WO1_RPB12_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) RPB12 Position  */
#define PPS_TC7WO1G2R_TC7WO1_OFF              (PPS_TC7WO1G2R_TC7WO1_OFF_Val << PPS_TC7WO1G2R_TC7WO1_Pos) /* (PPS_TC7WO1G2R) OFF Position  */
#define PPS_TC7WO1G2R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC7WO1G2R) Register Mask  */


/* -------- PPS_TC7WO1G4R : (PPS Offset: 0x124) (R/W 32)  -------- */
#define PPS_TC7WO1G4R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC7WO1G4R)   Reset Value */

#define PPS_TC7WO1G4R_TC7WO1_Pos              _UINT32_(0)                                          /* (PPS_TC7WO1G4R) TC7/WO1G4 Position */
#define PPS_TC7WO1G4R_TC7WO1_Msk              (_UINT32_(0xF) << PPS_TC7WO1G4R_TC7WO1_Pos)          /* (PPS_TC7WO1G4R) TC7/WO1G4 Mask */
#define PPS_TC7WO1G4R_TC7WO1(value)           (PPS_TC7WO1G4R_TC7WO1_Msk & (_UINT32_(value) << PPS_TC7WO1G4R_TC7WO1_Pos)) /* Assigment of value for TC7WO1 in the PPS_TC7WO1G4R register */
#define   PPS_TC7WO1G4R_TC7WO1_RPA2_Val       _UINT32_(0xF)                                        /* (PPS_TC7WO1G4R) RPA2  */
#define   PPS_TC7WO1G4R_TC7WO1_RPA6_Val       _UINT32_(0x1)                                        /* (PPS_TC7WO1G4R) RPA6  */
#define   PPS_TC7WO1G4R_TC7WO1_RPA10_Val      _UINT32_(0x2)                                        /* (PPS_TC7WO1G4R) RPA10  */
#define   PPS_TC7WO1G4R_TC7WO1_RPA14_Val      _UINT32_(0x3)                                        /* (PPS_TC7WO1G4R) RPA14  */
#define   PPS_TC7WO1G4R_TC7WO1_RPB3_Val       _UINT32_(0x4)                                        /* (PPS_TC7WO1G4R) RPB3  */
#define   PPS_TC7WO1G4R_TC7WO1_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_TC7WO1G4R) RPB7  */
#define   PPS_TC7WO1G4R_TC7WO1_RPB11_Val      _UINT32_(0x6)                                        /* (PPS_TC7WO1G4R) RPB11  */
#define   PPS_TC7WO1G4R_TC7WO1_RPA1_Val       _UINT32_(0x7)                                        /* (PPS_TC7WO1G4R) RPA1  */
#define   PPS_TC7WO1G4R_TC7WO1_RPA5_Val       _UINT32_(0x8)                                        /* (PPS_TC7WO1G4R) RPA5  */
#define   PPS_TC7WO1G4R_TC7WO1_RPA9_Val       _UINT32_(0x9)                                        /* (PPS_TC7WO1G4R) RPA9  */
#define   PPS_TC7WO1G4R_TC7WO1_RPA13_Val      _UINT32_(0xA)                                        /* (PPS_TC7WO1G4R) RPA13  */
#define   PPS_TC7WO1G4R_TC7WO1_RPB2_Val       _UINT32_(0xB)                                        /* (PPS_TC7WO1G4R) RPB2  */
#define   PPS_TC7WO1G4R_TC7WO1_RPB6_Val       _UINT32_(0xC)                                        /* (PPS_TC7WO1G4R) RPB6  */
#define   PPS_TC7WO1G4R_TC7WO1_RPB10_Val      _UINT32_(0xD)                                        /* (PPS_TC7WO1G4R) RPB10  */
#define   PPS_TC7WO1G4R_TC7WO1_RPA8_Val       _UINT32_(0xE)                                        /* (PPS_TC7WO1G4R) RPA8  */
#define   PPS_TC7WO1G4R_TC7WO1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC7WO1G4R) OFF  */
#define PPS_TC7WO1G4R_TC7WO1_RPA2             (PPS_TC7WO1G4R_TC7WO1_RPA2_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPA2 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPA6             (PPS_TC7WO1G4R_TC7WO1_RPA6_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPA6 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPA10            (PPS_TC7WO1G4R_TC7WO1_RPA10_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPA10 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPA14            (PPS_TC7WO1G4R_TC7WO1_RPA14_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPA14 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPB3             (PPS_TC7WO1G4R_TC7WO1_RPB3_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPB3 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPB7             (PPS_TC7WO1G4R_TC7WO1_RPB7_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPB7 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPB11            (PPS_TC7WO1G4R_TC7WO1_RPB11_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPB11 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPA1             (PPS_TC7WO1G4R_TC7WO1_RPA1_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPA1 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPA5             (PPS_TC7WO1G4R_TC7WO1_RPA5_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPA5 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPA9             (PPS_TC7WO1G4R_TC7WO1_RPA9_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPA9 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPA13            (PPS_TC7WO1G4R_TC7WO1_RPA13_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPA13 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPB2             (PPS_TC7WO1G4R_TC7WO1_RPB2_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPB2 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPB6             (PPS_TC7WO1G4R_TC7WO1_RPB6_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPB6 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPB10            (PPS_TC7WO1G4R_TC7WO1_RPB10_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPB10 Position  */
#define PPS_TC7WO1G4R_TC7WO1_RPA8             (PPS_TC7WO1G4R_TC7WO1_RPA8_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) RPA8 Position  */
#define PPS_TC7WO1G4R_TC7WO1_OFF              (PPS_TC7WO1G4R_TC7WO1_OFF_Val << PPS_TC7WO1G4R_TC7WO1_Pos) /* (PPS_TC7WO1G4R) OFF Position  */
#define PPS_TC7WO1G4R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC7WO1G4R) Register Mask  */


/* -------- PPS_RPA0G2R : (PPS Offset: 0x200) (R/W 32)  -------- */
#define PPS_RPA0G2R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPA0G2R)   Reset Value */

#define PPS_RPA0G2R_RPA0G2R_Pos               _UINT32_(0)                                          /* (PPS_RPA0G2R) RPA0/G2 Position */
#define PPS_RPA0G2R_RPA0G2R_Msk               (_UINT32_(0x1F) << PPS_RPA0G2R_RPA0G2R_Pos)          /* (PPS_RPA0G2R) RPA0/G2 Mask */
#define PPS_RPA0G2R_RPA0G2R(value)            (PPS_RPA0G2R_RPA0G2R_Msk & (_UINT32_(value) << PPS_RPA0G2R_RPA0G2R_Pos)) /* Assigment of value for RPA0G2R in the PPS_RPA0G2R register */
#define   PPS_RPA0G2R_RPA0G2R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPA0G2R) OFF  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM0P0_Val     _UINT32_(0x1)                                        /* (PPS_RPA0G2R) SERCOM0/PAD0  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM0P3_Val     _UINT32_(0x2)                                        /* (PPS_RPA0G2R) SERCOM0/PAD3  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM0P2_Val     _UINT32_(0x3)                                        /* (PPS_RPA0G2R) SERCOM0/PAD2  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM1P3_Val     _UINT32_(0x5)                                        /* (PPS_RPA0G2R) SERCOM1/PAD3  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM1P2_Val     _UINT32_(0x6)                                        /* (PPS_RPA0G2R) SERCOM1/PAD2  */
#define   PPS_RPA0G2R_RPA0G2R_TCC0WO1_Val     _UINT32_(0x7)                                        /* (PPS_RPA0G2R) TCC0/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TCC0WO5_Val     _UINT32_(0x8)                                        /* (PPS_RPA0G2R) TCC0/WO5  */
#define   PPS_RPA0G2R_RPA0G2R_TCC0WO3_Val     _UINT32_(0x9)                                        /* (PPS_RPA0G2R) TCC0/WO3  */
#define   PPS_RPA0G2R_RPA0G2R_TCC1WO1_Val     _UINT32_(0xA)                                        /* (PPS_RPA0G2R) TCC1/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TCC1WO5_Val     _UINT32_(0xB)                                        /* (PPS_RPA0G2R) TCC1/WO5  */
#define   PPS_RPA0G2R_RPA0G2R_TCC1WO3_Val     _UINT32_(0xC)                                        /* (PPS_RPA0G2R) TCC1/WO3  */
#define   PPS_RPA0G2R_RPA0G2R_TCC2WO1_Val     _UINT32_(0xD)                                        /* (PPS_RPA0G2R) TCC2/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TC0WO1_Val      _UINT32_(0xF)                                        /* (PPS_RPA0G2R) TC0/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TC1WO1_Val      _UINT32_(0x10)                                       /* (PPS_RPA0G2R) TC1/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TC2WO1_Val      _UINT32_(0x11)                                       /* (PPS_RPA0G2R) TC2/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TC3WO1_Val      _UINT32_(0x12)                                       /* (PPS_RPA0G2R) TC3/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TC4WO1_Val      _UINT32_(0x13)                                       /* (PPS_RPA0G2R) TC4/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TC5WO1_Val      _UINT32_(0x14)                                       /* (PPS_RPA0G2R) TC5/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TC6WO1_Val      _UINT32_(0x15)                                       /* (PPS_RPA0G2R) TC6/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TC7WO1_Val      _UINT32_(0x16)                                       /* (PPS_RPA0G2R) TC7/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_QSPICS_Val      _UINT32_(0x17)                                       /* (PPS_RPA0G2R) QSPI/CS  */
#define   PPS_RPA0G2R_RPA0G2R_QD0_Val         _UINT32_(0x18)                                       /* (PPS_RPA0G2R) QD0  */
#define   PPS_RPA0G2R_RPA0G2R_QD3_Val         _UINT32_(0x19)                                       /* (PPS_RPA0G2R) QD3  */
#define   PPS_RPA0G2R_RPA0G2R_QD2_Val         _UINT32_(0x1A)                                       /* (PPS_RPA0G2R) QD2  */
#define   PPS_RPA0G2R_RPA0G2R_CCLOUT1_Val     _UINT32_(0x1B)                                       /* (PPS_RPA0G2R) CCLOUT1  */
#define   PPS_RPA0G2R_RPA0G2R_TSTBUS0_Val     _UINT32_(0x1C)                                       /* (PPS_RPA0G2R) TSTBUS0  */
#define   PPS_RPA0G2R_RPA0G2R_TSTBUS3_Val     _UINT32_(0x1D)                                       /* (PPS_RPA0G2R) TSTBUS3  */
#define   PPS_RPA0G2R_RPA0G2R_TSTBUS6_Val     _UINT32_(0x1E)                                       /* (PPS_RPA0G2R) TSTBUS6  */
#define   PPS_RPA0G2R_RPA0G2R_TSTBUS9_Val     _UINT32_(0x1F)                                       /* (PPS_RPA0G2R) TSTBUS9  */
#define PPS_RPA0G2R_RPA0G2R_OFF               (PPS_RPA0G2R_RPA0G2R_OFF_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) OFF Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM0P0           (PPS_RPA0G2R_RPA0G2R_SCOM0P0_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM0/PAD0 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM0P3           (PPS_RPA0G2R_RPA0G2R_SCOM0P3_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM0/PAD3 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM0P2           (PPS_RPA0G2R_RPA0G2R_SCOM0P2_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM0/PAD2 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM1P3           (PPS_RPA0G2R_RPA0G2R_SCOM1P3_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM1/PAD3 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM1P2           (PPS_RPA0G2R_RPA0G2R_SCOM1P2_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM1/PAD2 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC0WO1           (PPS_RPA0G2R_RPA0G2R_TCC0WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC0/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC0WO5           (PPS_RPA0G2R_RPA0G2R_TCC0WO5_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC0/WO5 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC0WO3           (PPS_RPA0G2R_RPA0G2R_TCC0WO3_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC0/WO3 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC1WO1           (PPS_RPA0G2R_RPA0G2R_TCC1WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC1/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC1WO5           (PPS_RPA0G2R_RPA0G2R_TCC1WO5_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC1/WO5 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC1WO3           (PPS_RPA0G2R_RPA0G2R_TCC1WO3_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC1/WO3 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC2WO1           (PPS_RPA0G2R_RPA0G2R_TCC2WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC2/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TC0WO1            (PPS_RPA0G2R_RPA0G2R_TC0WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TC0/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TC1WO1            (PPS_RPA0G2R_RPA0G2R_TC1WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TC1/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TC2WO1            (PPS_RPA0G2R_RPA0G2R_TC2WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TC2/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TC3WO1            (PPS_RPA0G2R_RPA0G2R_TC3WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TC3/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TC4WO1            (PPS_RPA0G2R_RPA0G2R_TC4WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TC4/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TC5WO1            (PPS_RPA0G2R_RPA0G2R_TC5WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TC5/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TC6WO1            (PPS_RPA0G2R_RPA0G2R_TC6WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TC6/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TC7WO1            (PPS_RPA0G2R_RPA0G2R_TC7WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TC7/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_QSPICS            (PPS_RPA0G2R_RPA0G2R_QSPICS_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) QSPI/CS Position  */
#define PPS_RPA0G2R_RPA0G2R_QD0               (PPS_RPA0G2R_RPA0G2R_QD0_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) QD0 Position  */
#define PPS_RPA0G2R_RPA0G2R_QD3               (PPS_RPA0G2R_RPA0G2R_QD3_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) QD3 Position  */
#define PPS_RPA0G2R_RPA0G2R_QD2               (PPS_RPA0G2R_RPA0G2R_QD2_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) QD2 Position  */
#define PPS_RPA0G2R_RPA0G2R_CCLOUT1           (PPS_RPA0G2R_RPA0G2R_CCLOUT1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) CCLOUT1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TSTBUS0           (PPS_RPA0G2R_RPA0G2R_TSTBUS0_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TSTBUS0 Position  */
#define PPS_RPA0G2R_RPA0G2R_TSTBUS3           (PPS_RPA0G2R_RPA0G2R_TSTBUS3_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TSTBUS3 Position  */
#define PPS_RPA0G2R_RPA0G2R_TSTBUS6           (PPS_RPA0G2R_RPA0G2R_TSTBUS6_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TSTBUS6 Position  */
#define PPS_RPA0G2R_RPA0G2R_TSTBUS9           (PPS_RPA0G2R_RPA0G2R_TSTBUS9_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TSTBUS9 Position  */
#define PPS_RPA0G2R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPA0G2R) Register Mask  */


/* -------- PPS_RPA0G3R : (PPS Offset: 0x204) (R/W 32)  -------- */
#define PPS_RPA0G3R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPA0G3R)   Reset Value */

