Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/pps.h
/* -------- PPS_RPB6G1R : (PPS Offset: 0x2C0) (R/W 32)  -------- */
#define PPS_RPB6G1R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPB6G1R)   Reset Value */

#define PPS_RPB6G1R_RPB6G1R_Pos               _UINT32_(0)                                          /* (PPS_RPB6G1R) RPB6/G1 Position */
#define PPS_RPB6G1R_RPB6G1R_Msk               (_UINT32_(0x1F) << PPS_RPB6G1R_RPB6G1R_Pos)          /* (PPS_RPB6G1R) RPB6/G1 Mask */
#define PPS_RPB6G1R_RPB6G1R(value)            (PPS_RPB6G1R_RPB6G1R_Msk & (_UINT32_(value) << PPS_RPB6G1R_RPB6G1R_Pos)) /* Assigment of value for RPB6G1R in the PPS_RPB6G1R register */
#define   PPS_RPB6G1R_RPB6G1R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPB6G1R) OFF  */
#define   PPS_RPB6G1R_RPB6G1R_SCOM0P1_Val     _UINT32_(0x1)                                        /* (PPS_RPB6G1R) SERCOM0/PAD1  */
#define   PPS_RPB6G1R_RPB6G1R_SCOM1P1_Val     _UINT32_(0x2)                                        /* (PPS_RPB6G1R) SERCOM1/PAD1  */
#define   PPS_RPB6G1R_RPB6G1R_REFO1_Val       _UINT32_(0x3)                                        /* (PPS_RPB6G1R) REFO1  */
#define   PPS_RPB6G1R_RPB6G1R_REFO2_Val       _UINT32_(0x4)                                        /* (PPS_RPB6G1R) REFO2  */
#define   PPS_RPB6G1R_RPB6G1R_REFO3_Val       _UINT32_(0x5)                                        /* (PPS_RPB6G1R) REFO3  */
#define   PPS_RPB6G1R_RPB6G1R_REFO4_Val       _UINT32_(0x6)                                        /* (PPS_RPB6G1R) REFO4  */
#define   PPS_RPB6G1R_RPB6G1R_QSCK_Val        _UINT32_(0x7)                                        /* (PPS_RPB6G1R) QSCK  */
#define PPS_RPB6G1R_RPB6G1R_OFF               (PPS_RPB6G1R_RPB6G1R_OFF_Val << PPS_RPB6G1R_RPB6G1R_Pos) /* (PPS_RPB6G1R) OFF Position  */
#define PPS_RPB6G1R_RPB6G1R_SCOM0P1           (PPS_RPB6G1R_RPB6G1R_SCOM0P1_Val << PPS_RPB6G1R_RPB6G1R_Pos) /* (PPS_RPB6G1R) SERCOM0/PAD1 Position  */
#define PPS_RPB6G1R_RPB6G1R_SCOM1P1           (PPS_RPB6G1R_RPB6G1R_SCOM1P1_Val << PPS_RPB6G1R_RPB6G1R_Pos) /* (PPS_RPB6G1R) SERCOM1/PAD1 Position  */
#define PPS_RPB6G1R_RPB6G1R_REFO1             (PPS_RPB6G1R_RPB6G1R_REFO1_Val << PPS_RPB6G1R_RPB6G1R_Pos) /* (PPS_RPB6G1R) REFO1 Position  */
#define PPS_RPB6G1R_RPB6G1R_REFO2             (PPS_RPB6G1R_RPB6G1R_REFO2_Val << PPS_RPB6G1R_RPB6G1R_Pos) /* (PPS_RPB6G1R) REFO2 Position  */
#define PPS_RPB6G1R_RPB6G1R_REFO3             (PPS_RPB6G1R_RPB6G1R_REFO3_Val << PPS_RPB6G1R_RPB6G1R_Pos) /* (PPS_RPB6G1R) REFO3 Position  */
#define PPS_RPB6G1R_RPB6G1R_REFO4             (PPS_RPB6G1R_RPB6G1R_REFO4_Val << PPS_RPB6G1R_RPB6G1R_Pos) /* (PPS_RPB6G1R) REFO4 Position  */
#define PPS_RPB6G1R_RPB6G1R_QSCK              (PPS_RPB6G1R_RPB6G1R_QSCK_Val << PPS_RPB6G1R_RPB6G1R_Pos) /* (PPS_RPB6G1R) QSCK Position  */
#define PPS_RPB6G1R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPB6G1R) Register Mask  */


/* -------- PPS_RPB7G1R : (PPS Offset: 0x2C4) (R/W 32)  -------- */
#define PPS_RPB7G1R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPB7G1R)   Reset Value */

#define PPS_RPB7G1R_RPB7G1R_Pos               _UINT32_(0)                                          /* (PPS_RPB7G1R) RPB7/G1 Position */
#define PPS_RPB7G1R_RPB7G1R_Msk               (_UINT32_(0x1F) << PPS_RPB7G1R_RPB7G1R_Pos)          /* (PPS_RPB7G1R) RPB7/G1 Mask */
#define PPS_RPB7G1R_RPB7G1R(value)            (PPS_RPB7G1R_RPB7G1R_Msk & (_UINT32_(value) << PPS_RPB7G1R_RPB7G1R_Pos)) /* Assigment of value for RPB7G1R in the PPS_RPB7G1R register */
#define   PPS_RPB7G1R_RPB7G1R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPB7G1R) OFF  */
#define   PPS_RPB7G1R_RPB7G1R_SCOM0P1_Val     _UINT32_(0x1)                                        /* (PPS_RPB7G1R) SERCOM0/PAD1  */
#define   PPS_RPB7G1R_RPB7G1R_SCOM1P1_Val     _UINT32_(0x2)                                        /* (PPS_RPB7G1R) SERCOM1/PAD1  */
#define   PPS_RPB7G1R_RPB7G1R_REFO1_Val       _UINT32_(0x3)                                        /* (PPS_RPB7G1R) REFO1  */
#define   PPS_RPB7G1R_RPB7G1R_REFO2_Val       _UINT32_(0x4)                                        /* (PPS_RPB7G1R) REFO2  */
#define   PPS_RPB7G1R_RPB7G1R_REFO3_Val       _UINT32_(0x5)                                        /* (PPS_RPB7G1R) REFO3  */
#define   PPS_RPB7G1R_RPB7G1R_REFO4_Val       _UINT32_(0x6)                                        /* (PPS_RPB7G1R) REFO4  */
#define   PPS_RPB7G1R_RPB7G1R_QSCK_Val        _UINT32_(0x7)                                        /* (PPS_RPB7G1R) QSCK  */
#define PPS_RPB7G1R_RPB7G1R_OFF               (PPS_RPB7G1R_RPB7G1R_OFF_Val << PPS_RPB7G1R_RPB7G1R_Pos) /* (PPS_RPB7G1R) OFF Position  */
#define PPS_RPB7G1R_RPB7G1R_SCOM0P1           (PPS_RPB7G1R_RPB7G1R_SCOM0P1_Val << PPS_RPB7G1R_RPB7G1R_Pos) /* (PPS_RPB7G1R) SERCOM0/PAD1 Position  */
#define PPS_RPB7G1R_RPB7G1R_SCOM1P1           (PPS_RPB7G1R_RPB7G1R_SCOM1P1_Val << PPS_RPB7G1R_RPB7G1R_Pos) /* (PPS_RPB7G1R) SERCOM1/PAD1 Position  */
#define PPS_RPB7G1R_RPB7G1R_REFO1             (PPS_RPB7G1R_RPB7G1R_REFO1_Val << PPS_RPB7G1R_RPB7G1R_Pos) /* (PPS_RPB7G1R) REFO1 Position  */
#define PPS_RPB7G1R_RPB7G1R_REFO2             (PPS_RPB7G1R_RPB7G1R_REFO2_Val << PPS_RPB7G1R_RPB7G1R_Pos) /* (PPS_RPB7G1R) REFO2 Position  */
#define PPS_RPB7G1R_RPB7G1R_REFO3             (PPS_RPB7G1R_RPB7G1R_REFO3_Val << PPS_RPB7G1R_RPB7G1R_Pos) /* (PPS_RPB7G1R) REFO3 Position  */
#define PPS_RPB7G1R_RPB7G1R_REFO4             (PPS_RPB7G1R_RPB7G1R_REFO4_Val << PPS_RPB7G1R_RPB7G1R_Pos) /* (PPS_RPB7G1R) REFO4 Position  */
#define PPS_RPB7G1R_RPB7G1R_QSCK              (PPS_RPB7G1R_RPB7G1R_QSCK_Val << PPS_RPB7G1R_RPB7G1R_Pos) /* (PPS_RPB7G1R) QSCK Position  */
#define PPS_RPB7G1R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPB7G1R) Register Mask  */


/* -------- PPS_RPB7G4R : (PPS Offset: 0x2C8) (R/W 32)  -------- */
#define PPS_RPB7G4R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPB7G4R)   Reset Value */

