Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/pps.h
/** \brief PPS register offsets definitions */
#define PPS_EXTINT0R_REG_OFST          _UINT32_(0x00)      /* (PPS_EXTINT0R)  Offset */
#define PPS_EXTINT1R_REG_OFST          _UINT32_(0x04)      /* (PPS_EXTINT1R)  Offset */
#define PPS_EXTINT2R_REG_OFST          _UINT32_(0x08)      /* (PPS_EXTINT2R)  Offset */
#define PPS_EXTINT3R_REG_OFST          _UINT32_(0x0C)      /* (PPS_EXTINT3R)  Offset */
#define PPS_NMIR_REG_OFST              _UINT32_(0x3C)      /* (PPS_NMIR)  Offset */
#define PPS_SCOM0P0R_REG_OFST          _UINT32_(0x40)      /* (PPS_SCOM0P0R)  Offset */
#define PPS_SCOM0P1R_REG_OFST          _UINT32_(0x44)      /* (PPS_SCOM0P1R)  Offset */
#define PPS_SCOM0P2R_REG_OFST          _UINT32_(0x48)      /* (PPS_SCOM0P2R)  Offset */
#define PPS_SCOM0P3R_REG_OFST          _UINT32_(0x4C)      /* (PPS_SCOM0P3R)  Offset */
#define PPS_SCOM1P0R_REG_OFST          _UINT32_(0x50)      /* (PPS_SCOM1P0R)  Offset */
#define PPS_SCOM1P1R_REG_OFST          _UINT32_(0x54)      /* (PPS_SCOM1P1R)  Offset */
#define PPS_SCOM1P2R_REG_OFST          _UINT32_(0x58)      /* (PPS_SCOM1P2R)  Offset */
#define PPS_SCOM1P3R_REG_OFST          _UINT32_(0x5C)      /* (PPS_SCOM1P3R)  Offset */
#define PPS_QD0R_REG_OFST              _UINT32_(0x84)      /* (PPS_QD0R)  Offset */
#define PPS_QD1R_REG_OFST              _UINT32_(0x88)      /* (PPS_QD1R)  Offset */
#define PPS_QD2R_REG_OFST              _UINT32_(0x8C)      /* (PPS_QD2R)  Offset */
#define PPS_QD3R_REG_OFST              _UINT32_(0x90)      /* (PPS_QD3R)  Offset */
#define PPS_REFIR_REG_OFST             _UINT32_(0x94)      /* (PPS_REFIR)  Offset */
#define PPS_CCLIN0R_REG_OFST           _UINT32_(0x98)      /* (PPS_CCLIN0R)  Offset */
#define PPS_CCLIN1R_REG_OFST           _UINT32_(0x9C)      /* (PPS_CCLIN1R)  Offset */
#define PPS_CCLIN2R_REG_OFST           _UINT32_(0xA0)      /* (PPS_CCLIN2R)  Offset */
#define PPS_CCLIN3R_REG_OFST           _UINT32_(0xA4)      /* (PPS_CCLIN3R)  Offset */
#define PPS_CCLIN4R_REG_OFST           _UINT32_(0xA8)      /* (PPS_CCLIN4R)  Offset */
#define PPS_CCLIN5R_REG_OFST           _UINT32_(0xAC)      /* (PPS_CCLIN5R)  Offset */
#define PPS_TC0WO0G1R_REG_OFST         _UINT32_(0xB0)      /* (PPS_TC0WO0G1R)  Offset */
#define PPS_TC0WO0G2R_REG_OFST         _UINT32_(0xB4)      /* (PPS_TC0WO0G2R)  Offset */
#define PPS_TC0WO1G3R_REG_OFST         _UINT32_(0xB8)      /* (PPS_TC0WO1G3R)  Offset */
#define PPS_TC0WO1G4R_REG_OFST         _UINT32_(0xBC)      /* (PPS_TC0WO1G4R)  Offset */
#define PPS_TC1WO0G1R_REG_OFST         _UINT32_(0xC0)      /* (PPS_TC1WO0G1R)  Offset */
#define PPS_TC1WO1G2R_REG_OFST         _UINT32_(0xC4)      /* (PPS_TC1WO1G2R)  Offset */
#define PPS_TC2WO0G1R_REG_OFST         _UINT32_(0xC8)      /* (PPS_TC2WO0G1R)  Offset */
#define PPS_TC2WO0G3R_REG_OFST         _UINT32_(0xCC)      /* (PPS_TC2WO0G3R)  Offset */
#define PPS_TC2WO1G2R_REG_OFST         _UINT32_(0xD0)      /* (PPS_TC2WO1G2R)  Offset */
#define PPS_TC2WO1G4R_REG_OFST         _UINT32_(0xD4)      /* (PPS_TC2WO1G4R)  Offset */
#define PPS_TC3WO0G1R_REG_OFST         _UINT32_(0xD8)      /* (PPS_TC3WO0G1R)  Offset */
#define PPS_TC3WO0G3R_REG_OFST         _UINT32_(0xDC)      /* (PPS_TC3WO0G3R)  Offset */
#define PPS_TC3WO1G2R_REG_OFST         _UINT32_(0xE0)      /* (PPS_TC3WO1G2R)  Offset */
#define PPS_TC3WO1G4R_REG_OFST         _UINT32_(0xE4)      /* (PPS_TC3WO1G4R)  Offset */
#define PPS_TC4WO0G1R_REG_OFST         _UINT32_(0xE8)      /* (PPS_TC4WO0G1R)  Offset */
#define PPS_TC4WO0G3R_REG_OFST         _UINT32_(0xEC)      /* (PPS_TC4WO0G3R)  Offset */
#define PPS_TC4WO1G2R_REG_OFST         _UINT32_(0xF0)      /* (PPS_TC4WO1G2R)  Offset */
#define PPS_TC4WO1G4R_REG_OFST         _UINT32_(0xF4)      /* (PPS_TC4WO1G4R)  Offset */
#define PPS_TC5WO0G1R_REG_OFST         _UINT32_(0xF8)      /* (PPS_TC5WO0G1R)  Offset */
#define PPS_TC5WO0G3R_REG_OFST         _UINT32_(0xFC)      /* (PPS_TC5WO0G3R)  Offset */
#define PPS_TC5WO1G2R_REG_OFST         _UINT32_(0x100)     /* (PPS_TC5WO1G2R)  Offset */
#define PPS_TC5WO1G4R_REG_OFST         _UINT32_(0x104)     /* (PPS_TC5WO1G4R)  Offset */
#define PPS_TC6WO0G1R_REG_OFST         _UINT32_(0x108)     /* (PPS_TC6WO0G1R)  Offset */
#define PPS_TC6WO0G3R_REG_OFST         _UINT32_(0x10C)     /* (PPS_TC6WO0G3R)  Offset */
#define PPS_TC6WO1G2R_REG_OFST         _UINT32_(0x110)     /* (PPS_TC6WO1G2R)  Offset */
#define PPS_TC6WO1G4R_REG_OFST         _UINT32_(0x114)     /* (PPS_TC6WO1G4R)  Offset */
#define PPS_TC7WO0G1R_REG_OFST         _UINT32_(0x118)     /* (PPS_TC7WO0G1R)  Offset */
#define PPS_TC7WO0G3R_REG_OFST         _UINT32_(0x11C)     /* (PPS_TC7WO0G3R)  Offset */
#define PPS_TC7WO1G2R_REG_OFST         _UINT32_(0x120)     /* (PPS_TC7WO1G2R)  Offset */
#define PPS_TC7WO1G4R_REG_OFST         _UINT32_(0x124)     /* (PPS_TC7WO1G4R)  Offset */
#define PPS_RPA0G2R_REG_OFST           _UINT32_(0x200)     /* (PPS_RPA0G2R)  Offset */
#define PPS_RPA0G3R_REG_OFST           _UINT32_(0x204)     /* (PPS_RPA0G3R)  Offset */
#define PPS_RPA1G3R_REG_OFST           _UINT32_(0x208)     /* (PPS_RPA1G3R)  Offset */
#define PPS_RPA1G4R_REG_OFST           _UINT32_(0x20C)     /* (PPS_RPA1G4R)  Offset */
#define PPS_RPA2G4R_REG_OFST           _UINT32_(0x214)     /* (PPS_RPA2G4R)  Offset */
#define PPS_RPA3G1R_REG_OFST           _UINT32_(0x218)     /* (PPS_RPA3G1R)  Offset */
#define PPS_RPA3G2R_REG_OFST           _UINT32_(0x21C)     /* (PPS_RPA3G2R)  Offset */
#define PPS_RPA3G3R_REG_OFST           _UINT32_(0x220)     /* (PPS_RPA3G3R)  Offset */
#define PPS_RPA4G2R_REG_OFST           _UINT32_(0x224)     /* (PPS_RPA4G2R)  Offset */
#define PPS_RPA4G3R_REG_OFST           _UINT32_(0x228)     /* (PPS_RPA4G3R)  Offset */
#define PPS_RPA4G4R_REG_OFST           _UINT32_(0x22C)     /* (PPS_RPA4G4R)  Offset */
#define PPS_RPA5G1R_REG_OFST           _UINT32_(0x230)     /* (PPS_RPA5G1R)  Offset */
#define PPS_RPA5G3R_REG_OFST           _UINT32_(0x234)     /* (PPS_RPA5G3R)  Offset */
#define PPS_RPA5G4R_REG_OFST           _UINT32_(0x238)     /* (PPS_RPA5G4R)  Offset */
#define PPS_RPA6G1R_REG_OFST           _UINT32_(0x23C)     /* (PPS_RPA6G1R)  Offset */
#define PPS_RPA6G2R_REG_OFST           _UINT32_(0x240)     /* (PPS_RPA6G2R)  Offset */
#define PPS_RPA6G4R_REG_OFST           _UINT32_(0x244)     /* (PPS_RPA6G4R)  Offset */
#define PPS_RPA7G1R_REG_OFST           _UINT32_(0x248)     /* (PPS_RPA7G1R)  Offset */
#define PPS_RPA7G2R_REG_OFST           _UINT32_(0x24C)     /* (PPS_RPA7G2R)  Offset */
#define PPS_RPA8G2R_REG_OFST           _UINT32_(0x250)     /* (PPS_RPA8G2R)  Offset */
#define PPS_RPA8G3R_REG_OFST           _UINT32_(0x254)     /* (PPS_RPA8G3R)  Offset */
#define PPS_RPA8G4R_REG_OFST           _UINT32_(0x258)     /* (PPS_RPA8G4R)  Offset */
#define PPS_RPA9G3R_REG_OFST           _UINT32_(0x260)     /* (PPS_RPA9G3R)  Offset */
#define PPS_RPA9G4R_REG_OFST           _UINT32_(0x264)     /* (PPS_RPA9G4R)  Offset */
#define PPS_RPA10G4R_REG_OFST          _UINT32_(0x26C)     /* (PPS_RPA10G4R)  Offset */
#define PPS_RPA13G3R_REG_OFST          _UINT32_(0x278)     /* (PPS_RPA13G3R)  Offset */
#define PPS_RPA13G4R_REG_OFST          _UINT32_(0x27C)     /* (PPS_RPA13G4R)  Offset */
#define PPS_RPA14G4R_REG_OFST          _UINT32_(0x284)     /* (PPS_RPA14G4R)  Offset */
#define PPS_RPB0G2R_REG_OFST           _UINT32_(0x290)     /* (PPS_RPB0G2R)  Offset */
#define PPS_RPB1G2R_REG_OFST           _UINT32_(0x294)     /* (PPS_RPB1G2R)  Offset */
#define PPS_RPB1G3R_REG_OFST           _UINT32_(0x298)     /* (PPS_RPB1G3R)  Offset */
#define PPS_RPB2G3R_REG_OFST           _UINT32_(0x29C)     /* (PPS_RPB2G3R)  Offset */
#define PPS_RPB2G4R_REG_OFST           _UINT32_(0x2A0)     /* (PPS_RPB2G4R)  Offset */
#define PPS_RPB3G4R_REG_OFST           _UINT32_(0x2A8)     /* (PPS_RPB3G4R)  Offset */
#define PPS_RPB4G2R_REG_OFST           _UINT32_(0x2B0)     /* (PPS_RPB4G2R)  Offset */
#define PPS_RPB5G2R_REG_OFST           _UINT32_(0x2B4)     /* (PPS_RPB5G2R)  Offset */
#define PPS_RPB5G1R_REG_OFST           _UINT32_(0x2B8)     /* (PPS_RPB5G1R)  Offset */
#define PPS_RPB6G3R_REG_OFST           _UINT32_(0x2BC)     /* (PPS_RPB6G3R)  Offset */
#define PPS_RPB6G1R_REG_OFST           _UINT32_(0x2C0)     /* (PPS_RPB6G1R)  Offset */
#define PPS_RPB7G1R_REG_OFST           _UINT32_(0x2C4)     /* (PPS_RPB7G1R)  Offset */
#define PPS_RPB7G4R_REG_OFST           _UINT32_(0x2C8)     /* (PPS_RPB7G4R)  Offset */
#define PPS_RPB8G1R_REG_OFST           _UINT32_(0x2CC)     /* (PPS_RPB8G1R)  Offset */
#define PPS_RPB8G2R_REG_OFST           _UINT32_(0x2D0)     /* (PPS_RPB8G2R)  Offset */
#define PPS_RPB9G1R_REG_OFST           _UINT32_(0x2D4)     /* (PPS_RPB9G1R)  Offset */
#define PPS_RPB9G3R_REG_OFST           _UINT32_(0x2D8)     /* (PPS_RPB9G3R)  Offset */
#define PPS_RPB10G3R_REG_OFST          _UINT32_(0x2DC)     /* (PPS_RPB10G3R)  Offset */
#define PPS_RPB10G4R_REG_OFST          _UINT32_(0x2E0)     /* (PPS_RPB10G4R)  Offset */
#define PPS_RPB11G4R_REG_OFST          _UINT32_(0x2E8)     /* (PPS_RPB11G4R)  Offset */
#define PPS_RPB12G2R_REG_OFST          _UINT32_(0x2F0)     /* (PPS_RPB12G2R)  Offset */
#define PPS_RPB13G2R_REG_OFST          _UINT32_(0x2F4)     /* (PPS_RPB13G2R)  Offset */
#define PPS_RPB13G3R_REG_OFST          _UINT32_(0x2F8)     /* (PPS_RPB13G3R)  Offset */

